In [ ]:
import pandas as pd
import numpy as np

In [1]:
df1 = pd.DataFrame({
    "name":["小明","小红","小孙","王小","关宇","刘蓓","张菲"],
    "age":[20,18,27,20,28,18,25],
    "sex":["男","女","男","男","男","女","女"],
    "score":[669,570,642,590,601,619,701],
    "address":["北京","深圳","广州","武汉","深圳","广州","长沙"]
})

df1

  name  age sex  score address
0   小明   20   男    669      北京
1   小红   18   女    570      深圳
2   小孙   27   男    642      广州
3   王小   20   男    590      武汉
4   关宇   28   男    601      深圳
5   刘蓓   18   女    619      广州
6   张菲   25   女    701      长沙

In [2]:
df1.shape

(7, 5)

In [3]:
df1.columns

Index(['name', 'age', 'sex', 'score', 'address'], dtype='object')

In [4]:
df1.dtypes

name       object
age         int64
sex        object
score       int64
address    object
dtype: object

In [5]:
df1.isnull()

    name    age    sex  score  address
0  False  False  False  False    False
1  False  False  False  False    False
2  False  False  False  False    False
3  False  False  False  False    False
4  False  False  False  False    False
5  False  False  False  False    False
6  False  False  False  False    False

In [6]:
df1.isnull().sum()

name       0
age        0
sex        0
score      0
address    0
dtype: int64

In [7]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [9]:
df1.describe()

             age       score
count   7.000000    7.000000
mean   22.285714  627.428571
std     4.270608   46.227182
min    18.000000  570.000000
25%    19.000000  595.500000
50%    20.000000  619.000000
75%    26.000000  655.500000
max    28.000000  701.000000

In [11]:
name=df1['name']
name

0    小明
1    小红
2    小孙
3    王小
4    关宇
5    刘蓓
6    张菲
Name: name, dtype: object

In [14]:
name_age=df1[['name','age']]
name_age

  name  age
0   小明   20
1   小红   18
2   小孙   27
3   王小   20
4   关宇   28
5   刘蓓   18
6   张菲   25